[
    {
        "creatorEmail": "siraj457689@gmail.com",
        "recipeImage": "https://i.ibb.co/M6w8TKz/1583851621211.jpg",
        "recipeDetails": "Spaghetti Carbonara is a classic Italian pasta dish made with eggs, cheese, pancetta, and pepper. The creamy sauce is achieved by tossing hot pasta with raw eggs, which cook from the residual heat, creating a rich and silky texture. The dish is typically garnished with freshly grated Pecorino Romano cheese and a generous amount of black pepper. This dish is a good source of protein from the eggs and pancetta, and calcium from the cheese. Using whole grain pasta can increase the fiber content, aiding in digestion and providing a slower release of energy. The simplicity of Carbonara ensures minimal processing, preserving more nutrients compared to heavily processed foods. Additionally, the dish contains essential vitamins and minerals, including vitamin A, vitamin B12, and selenium. The use of fresh ingredients and minimal additives make it a healthier choice, while the rich flavors ensure it is both satisfying and nutritious.",
        "youtubeLink": "https://www.youtube.com/embed/J0LAvL4G_cA?si=v8MWijBNQXBMHUQT",
        "country": "Bangladesh",
        "category": "Appetizers",
        "watchCount": 0,
        "purchased_by": [],
        "createTime": "2024-05-31T14:45:49.512Z"
    },
    {
        "creatorEmail": "siraj457689@gmail.com",
        "recipeImage": "https://i.ibb.co/Jtr2ZjH/1568735467631.jpg",
        "recipeDetails": "The Best Turkey Meatloaf is a delicious and healthy alternative to traditional meatloaf, made with lean ground turkey and a blend of flavorful ingredients. This meatloaf is seasoned with garlic, onion, and a mix of herbs, and is kept moist with the addition of finely chopped vegetables and breadcrumbs. It's topped with a tangy tomato glaze that caramelizes during baking, adding a sweet and savory finish. Turkey meatloaf is high in protein and lower in fat compared to beef meatloaf, making it a nutritious choice. The vegetables add fiber and essential vitamins, while the herbs and spices provide antioxidants. This recipe is perfect for a hearty, satisfying meal that is both wholesome and tasty.",
        "youtubeLink": "https://www.youtube.com/embed/zh_GegBFItw?si=msJPlX1aWLx8MLf3",
        "country": "Turkey",
        "category": "Appetizers",
        "watchCount": 0,
        "purchased_by": [],
        "createTime": "2024-05-31T14:48:17.830Z"
    },
    {
        "creatorEmail": "siraj457689@gmail.com",
        "recipeImage": "https://i.ibb.co/yWFvM1s/1567523590914.jpg",
        "recipeDetails": "The Best Stuffed Peppers are a flavorful and nutritious meal, featuring bell peppers filled with a savory mixture of ground meat, rice, and vegetables. This recipe combines lean ground beef or turkey with cooked rice, onions, garlic, tomatoes, and a blend of Italian herbs and spices. The filling is packed into hollowed-out bell peppers and baked until the peppers are tender and the filling is cooked through. A topping of melted cheese adds a deliciously gooey finish. Stuffed peppers are rich in protein, fiber, vitamins, and minerals. The bell peppers themselves are a great source of vitamins A and C, while the meat and rice provide protein and complex carbohydrates. This dish is a well-rounded, hearty meal that is both satisfying and healthy.",
        "youtubeLink": "https://www.youtube.com/embed/ektsiKFVqks?si=F7qH27rwk0M4_nsS",
        "country": "Turkey",
        "category": "Appetizers",
        "watchCount": 0,
        "purchased_by": [],
        "createTime": "2024-05-31T14:50:29.781Z"
    }    
]