[
    {
        "creatorEmail": "siraj457689@gmail.com",
        "recipeImage": "https://i.ibb.co/M6w8TKz/1583851621211.jpg",
        "recipeDetails": "Spaghetti Carbonara is a classic Italian pasta dish made with eggs, cheese, pancetta, and pepper. The creamy sauce is achieved by tossing hot pasta with raw eggs, which cook from the residual heat, creating a rich and silky texture. The dish is typically garnished with freshly grated Pecorino Romano cheese and a generous amount of black pepper. This dish is a good source of protein from the eggs and pancetta, and calcium from the cheese. Using whole grain pasta can increase the fiber content, aiding in digestion and providing a slower release of energy. The simplicity of Carbonara ensures minimal processing, preserving more nutrients compared to heavily processed foods. Additionally, the dish contains essential vitamins and minerals, including vitamin A, vitamin B12, and selenium. The use of fresh ingredients and minimal additives make it a healthier choice, while the rich flavors ensure it is both satisfying and nutritious.",
        "youtubeLink": "https://www.youtube.com/embed/J0LAvL4G_cA?si=v8MWijBNQXBMHUQT",
        "country": "Bangladesh",
        "category": "Appetizers",
        "watchCount": 0,
        "purchased_by": [],
        "createTime": "2024-05-31T14:45:49.512Z"
    },
    {
        "creatorEmail": "siraj457689@gmail.com",
        "recipeImage": "https://i.ibb.co/Jtr2ZjH/1568735467631.jpg",
        "recipeDetails": "The Best Turkey Meatloaf is a delicious and healthy alternative to traditional meatloaf, made with lean ground turkey and a blend of flavorful ingredients. This meatloaf is seasoned with garlic, onion, and a mix of herbs, and is kept moist with the addition of finely chopped vegetables and breadcrumbs. It's topped with a tangy tomato glaze that caramelizes during baking, adding a sweet and savory finish. Turkey meatloaf is high in protein and lower in fat compared to beef meatloaf, making it a nutritious choice. The vegetables add fiber and essential vitamins, while the herbs and spices provide antioxidants. This recipe is perfect for a hearty, satisfying meal that is both wholesome and tasty.",
        "youtubeLink": "https://www.youtube.com/embed/zh_GegBFItw?si=msJPlX1aWLx8MLf3",
        "country": "Turkey",
        "category": "Appetizers",
        "watchCount": 0,
        "purchased_by": [],
        "createTime": "2024-05-31T14:48:17.830Z"
    },
    {
        "creatorEmail": "siraj457689@gmail.com",
        "recipeImage": "https://i.ibb.co/yWFvM1s/1567523590914.jpg",
        "recipeDetails": "The Best Stuffed Peppers are a flavorful and nutritious meal, featuring bell peppers filled with a savory mixture of ground meat, rice, and vegetables. This recipe combines lean ground beef or turkey with cooked rice, onions, garlic, tomatoes, and a blend of Italian herbs and spices. The filling is packed into hollowed-out bell peppers and baked until the peppers are tender and the filling is cooked through. A topping of melted cheese adds a deliciously gooey finish. Stuffed peppers are rich in protein, fiber, vitamins, and minerals. The bell peppers themselves are a great source of vitamins A and C, while the meat and rice provide protein and complex carbohydrates. This dish is a well-rounded, hearty meal that is both satisfying and healthy.",
        "youtubeLink": "https://www.youtube.com/embed/ektsiKFVqks?si=F7qH27rwk0M4_nsS",
        "country": "Turkey",
        "category": "Appetizers",
        "watchCount": 0,
        "purchased_by": [],
        "createTime": "2024-05-31T14:50:29.781Z"
    },
    {
        "creatorEmail": "siraj457689@gmail.com",
        "recipeImage": "https://i.ibb.co/9t5q8SW/1568040661674.jpg",
        "recipeDetails": "The Best Blueberry Muffins are moist, tender, and bursting with juicy blueberries in every bite. This recipe starts with a simple batter made with flour, sugar, eggs, butter, and milk, flavored with a hint of vanilla extract and lemon zest. Fresh or frozen blueberries are gently folded into the batter, ensuring even distribution throughout the muffins. Baking these muffins at the right temperature ensures they rise beautifully and develop a golden-brown crust. Blueberry muffins are a classic breakfast or snack option that's loved by all ages. Blueberries are rich in antioxidants and vitamins, making these muffins a healthier treat option. They're perfect for a quick breakfast on the go or as a delightful addition to brunch or afternoon tea.",
        "youtubeLink": "https://www.youtube.com/embed/298pJ8G3Dj8?si=VDmrr6JkeQSklB1z",
        "country": "Turkey",
        "category": "Snacks",
        "watchCount": 0,
        "purchased_by": [],
        "createTime": "2024-05-31T14:52:24.148Z"
    },
    {
        "creatorEmail": "siraj457689@gmail.com",
        "recipeImage": "https://i.ibb.co/4YTz4Yt/cheesy-garlic-bread-TRR-1200-17-of-28.webp",
        "recipeDetails": "Cheesy Garlic Bread is a mouthwatering appetizer or side dish that's perfect for any occasion. Slices of crusty French bread are slathered with a garlic-infused butter spread and topped generously with a blend of melted cheeses. The bread is then toasted until golden and bubbly, creating a deliciously crispy exterior with a warm and gooey center. This cheesy delight is a crowd-pleaser and pairs well with pasta dishes, soups, or enjoyed on its own as a savory snack.",
        "youtubeLink": "https://www.youtube.com/embed/Am5xDq8k8bE?si=WOkhpe1IM0xS7-sq",
        "country": "United States",
        "category": "Appetizers",
        "watchCount": 0,
        "purchased_by": [],
        "createTime": "2024-05-31T15:00:00.000Z"
    },
    {
        "creatorEmail": "siraj457689@gmail.com",
        "recipeImage": "https://i.ibb.co/VpNhRGg/classic-caesar-salad-recipe-996054-Hero-01-33c94cc8b8e841ee8f2a815816a0af95.jpg",
        "recipeDetails": "Classic Caesar Salad is a timeless favorite, featuring crisp romaine lettuce tossed with a creamy Caesar dressing, Parmesan cheese, and crunchy croutons. The dressing is made with garlic, anchovies, egg yolk, lemon juice, Dijon mustard, and olive oil, creating a rich and flavorful dressing that coats every leaf of lettuce. Topped with grilled chicken or shrimp, this salad can be a satisfying meal on its own or served as a refreshing side dish.",
        "youtubeLink": "https://www.youtube.com/embed/tkdr4jt1Qvs?si=vOUDHZFOJnQaktkZ",
        "country": "United States",
        "category": "Vegetarian",
        "watchCount": 0,
        "purchased_by": [],
        "createTime": "2024-05-31T15:05:00.000Z"
    },
    {
        "creatorEmail": "siraj457689@gmail.com",
        "recipeImage": "https://i.ibb.co/pLQz9fn/Margherita-Pizza-093.jpg",
        "recipeDetails": "Homemade Margherita Pizza is a classic Italian pizza featuring a thin crust topped with fresh tomato sauce, slices of mozzarella cheese, and fragrant basil leaves. The simplicity of this pizza allows the quality of the ingredients to shine, creating a perfect balance of flavors and textures. Baked in a hot oven until the crust is crisp and the cheese is bubbly and golden, this homemade pizza is sure to impress.",
        "youtubeLink": "https://www.youtube.com/embed/vcfNpDtVqOw?si=V0R12t4yBpglcxUt",
        "country": "Italy",
        "category": "Snacks",
        "watchCount": 0,
        "purchased_by": [],
        "createTime": "2024-05-31T15:10:00.000Z"
    },
    {
        "creatorEmail": "siraj457689@gmail.com",
        "recipeImage": "https://i.ibb.co/dM8mQyb/1383814482359.jpg",
        "recipeDetails": "Greek Salad with Feta Cheese is a refreshing and vibrant salad that features crisp lettuce, juicy tomatoes, cucumbers, red onions, Kalamata olives, and creamy feta cheese, dressed with a simple vinaigrette made with olive oil, lemon juice, garlic, and oregano. This salad is bursting with Mediterranean flavors and is perfect as a light lunch or side dish for grilled meats or seafood.",
        "youtubeLink": "https://www.youtube.com/embed/dDhOpHcAJGo?si=jM0vC0TJ7mNDaSx4",
        "country": "Greece",
        "category": "Vegetarian",
        "watchCount": 0,
        "purchased_by": [],
        "createTime": "2024-05-31T15:15:00.000Z"
    },
    {
        "creatorEmail": "siraj457689@gmail.com",
        "recipeImage": "https://i.ibb.co/mrK8wbq/easy-creamy-mushroom-soup-quick-hero-Diana-Chistruga-a6bd62a54834493fb5fde46409e11af0.jpg",
        "recipeDetails": "Creamy Mushroom Risotto is a comforting and elegant dish made with Arborio rice cooked slowly in a flavorful broth until creamy and tender, then finished with sautéed mushrooms, garlic, shallots, white wine, Parmesan cheese, and butter. This classic Italian dish requires patience and attention to detail, but the result is well worth the effort. Creamy Mushroom Risotto is perfect as a main course or as a side dish for roasted meats or seafood.",
        "youtubeLink": "https://www.youtube.com/embed/XVJB764Y1Uc?si=EK0cfasttYfGSw48",
        "country": "Italy",
        "category": "Appetizers",
        "watchCount": 0,
        "purchased_by": [],
        "createTime": "2024-05-31T15:20:00.000Z"
    },
    {
        "creatorEmail": "siraj457689@gmail.com",
        "recipeImage": "https://i.ibb.co/yFRvJvq/Authentic-Tiramisu-Recipe-17-1.jpg",
        "recipeDetails": "Classic Tiramisu is a decadent Italian dessert made with layers of espresso-soaked ladyfingers and a rich mascarpone cream, dusted with cocoa powder for a finishing touch. This timeless dessert is a favorite for its delicate balance of flavors and textures, combining the bitterness of coffee with the sweetness of the cream and the sponge-like texture of the ladyfingers. Classic Tiramisu is perfect for special occasions or as a sweet ending to any meal.",
        "youtubeLink": "https://www.youtube.com/embed/87V4nizNJiE?si=D6yF3CJh-KLLbXWK",
        "country": "Italy",
        "category": "Dessert",
        "watchCount": 0,
        "purchased_by": [],
        "createTime": "2024-05-31T15:25:00.000Z"
    }            
]